In [10]:
import pandas as pd;

In [11]:
data = {
    'name':['vishal', 'om', 'Shubz', 'aditi'],
    'age':[21,22,22,21],
    'salary':[50000,44000,30000,22222],
    'department':['Computer', 'chemical', 'computer IT', 'Al ML']
}

Data = pd.DataFrame(data)
Data

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT
3   aditi   21   22222        Al ML

In [12]:
# 4. Rows and Column Selection.......................

In [17]:
Data[['name', 'age']]  # column Selection...

     name  age
0  vishal   21
1      om   22
2   Shubz   22
3   aditi   21

In [22]:
Data.loc[Data.name=='vishal']  # Rows Selection

     name  age  salary department
0  vishal   21   50000   Computer

In [24]:
Data.loc[(Data.name=='vishal') & (Data.age >= 21)]

     name  age  salary department
0  vishal   21   50000   Computer

In [29]:
Data.iloc[0]
Data.loc[ : 2]

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT

In [30]:
Data.iloc[ : 2]

     name  age  salary department
0  vishal   21   50000   Computer
1      om   22   44000   chemical

In [31]:
# 5. Filter DataFrame.....................................................

In [32]:
Data

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT
3   aditi   21   22222        Al ML

In [34]:
Data['age'] >= 22

0    False
1     True
2     True
3    False
Name: age, dtype: bool

In [35]:
Data[(Data['age'] >= 21) & (Data['salary'] >= 40000)]

     name  age  salary department
0  vishal   21   50000   Computer
1      om   22   44000   chemical

In [36]:
Data.where(Data['age'] >= 22)

    name   age   salary   department
0    NaN   NaN      NaN          NaN
1     om  22.0  44000.0     chemical
2  Shubz  22.0  30000.0  computer IT
3    NaN   NaN      NaN          NaN

In [ ]:
# 6. Rows and Columns - Operation(add, Update, Delete)

In [37]:
Data

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT
3   aditi   21   22222        Al ML

In [44]:
#Column Operation
#add
Data['Team'] = ['Ceo', 'Hr', 'DA', 'CtO']
Data

     name  age  salary   department Team
0  vishal   21   50000     Computer  Ceo
1      om   22   44000     chemical   Hr
2   Shubz   22   30000  computer IT   DA
3   aditi   21   22222        Al ML  CtO

In [46]:
Data['Bonus'] = Data['salary'] * 0.2
Data

     name  age  salary   department Team    Bonus
0  vishal   21   50000     Computer  Ceo  10000.0
1      om   22   44000     chemical   Hr   8800.0
2   Shubz   22   30000  computer IT   DA   6000.0
3   aditi   21   22222        Al ML  CtO   4444.4

In [50]:
# row Operation
# add
Data.loc[len(Data)] = ['Abc', 21, 30000, 'Computer', 'IT', 3333.0]
Data

     name  age  salary   department Team    Bonus
0  vishal   21   50000     Computer  Ceo  10000.0
1      om   22   44000     chemical   Hr   8800.0
2   Shubz   22   30000  computer IT   DA   6000.0
3   aditi   21   22222        Al ML  CtO   4444.4
4     Abc   21   30000     Computer   IT   3333.0

In [51]:
#update data
Data.loc[0, 'salary'] = 55000
Data

     name  age  salary   department Team    Bonus
0  vishal   21   55000     Computer  Ceo  10000.0
1      om   22   44000     chemical   Hr   8800.0
2   Shubz   22   30000  computer IT   DA   6000.0
3   aditi   21   22222        Al ML  CtO   4444.4
4     Abc   21   30000     Computer   IT   3333.0

In [52]:
Data.drop(Data[Data.name == 'Abc'].index)

     name  age  salary   department Team    Bonus
0  vishal   21   55000     Computer  Ceo  10000.0
1      om   22   44000     chemical   Hr   8800.0
2   Shubz   22   30000  computer IT   DA   6000.0
3   aditi   21   22222        Al ML  CtO   4444.4

In [53]:
Data.drop('Bonus', axis=1)

     name  age  salary   department Team
0  vishal   21   55000     Computer  Ceo
1      om   22   44000     chemical   Hr
2   Shubz   22   30000  computer IT   DA
3   aditi   21   22222        Al ML  CtO
4     Abc   21   30000     Computer   IT

In [55]:
Data.sort_values('salary')
Data.sort_values('salary',ascending= False)

     name  age  salary   department Team    Bonus
0  vishal   21   55000     Computer  Ceo  10000.0
1      om   22   44000     chemical   Hr   8800.0
2   Shubz   22   30000  computer IT   DA   6000.0
4     Abc   21   30000     Computer   IT   3333.0
3   aditi   21   22222        Al ML  CtO   4444.4